#include "Image.h"
#include <iostream>

void Image::church() {
    std::cout << R"(
    ¡ã¡ã  ¡ã¡ã  ¡ã¡ã  ¡ã¡ã
    ¡á¡á  ¡á¡á  ¡á¡á  ¡á¡á
    ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
    ¡á¢Ã¢Ã¡á¡á¢Ã¡á¡á¢Ã¢Ã¡á
    ¡á¢Ã¢Ã¡á¢Ã¢Ã¢Ã¡á¢Ã¢Ã¡á
    ¡á¡á¡á¡á¢Ã¢Ã¢Ã¡á¡á¡á¡á
¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿)" << std::endl;

}

void Image::triforce() {
    std::cout << "\n                   \033[33m¡Ú\033[0m" << std::endl;
    std::cout << R"(
                 ¡ä¡ä¡ä
               ¡ä¡ä¡ä¡ä¡ä
             ¡ä¡ä¡ä¡ä¡ä¡ä¡ä
           ¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã
           ¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã
¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À
¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À)"<<std::endl;
}

void Image::cat() {
    std::cout << R"(
  ¡ã          ¡ã
  ¡á¡á      ¡á¡á
¡á¡á¡á¡á¡á¡á¡á¡á¡á
¡á¡á¡Û¡á¡á¡á¡Û¡á¡á
¡á¡á¡á¡á¡â¡á¡á¡á¡á
  ¡á¡á¡á¡á¡á¡á¡á)" << std::endl;
}