#include "Image.h"
#include <iostream>

void Image::Church() {
    std::cout << R"(
    ¡ã¡ã  ¡ã¡ã  ¡ã¡ã  ¡ã¡ã
    ¡á¡á  ¡á¡á  ¡á¡á  ¡á¡á
    ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
    ¡á¢Ã¢Ã¡á¡á¢Ã¡á¡á¢Ã¢Ã¡á
    ¡á¢Ã¢Ã¡á¢Ã¢Ã¢Ã¡á¢Ã¢Ã¡á
    ¡á¡á¡á¡á¢Ã¢Ã¢Ã¡á¡á¡á¡á
¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿)" << std::endl;

}

void Image::Triforce() {
    std::cout << "\n                   \033[33m¡Ú\033[0m" << std::endl;
    std::cout << R"(
                 ¡ä¡ä¡ä
               ¡ä¡ä¡ä¡ä¡ä
             ¡ä¡ä¡ä¡ä¡ä¡ä¡ä
           ¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã
           ¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã¢Ã
¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À
¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À¢¿¢À)"<<std::endl;
}

void Image::Cat() {
    std::cout << R"(
  ¡ã          ¡ã
  ¡á¡á      ¡á¡á
¡á¡á¡á¡á¡á¡á¡á¡á¡á
¡á¡á¡Û¡á¡á¡á¡Û¡á¡á
¡á¡á¡á¡á¡â¡á¡á¡á¡á
  ¡á¡á¡á¡á¡á¡á¡á)" << std::endl;
}

void Image::cat2() {
    std::cout << R"(
 ¡ã¡ã
¡á¡á¡á
¡á¡á¡á
  ¡á¡á
 ¡á¡á¡á
¡á¡á¡á¡á
¡á¡á¡á¡á
¡á¡á¡á¡á
 ¡å  ¡å)" << std::endl;
}

void Image::cat3() {
    std::cout << R"(
 ¡ã¡ã                    ¡ß
¡á¡á¡á                ¡ß¡ß
¡Ü¡á¡á              ¡ß
   ¡á¡á           ¡ß
 ¡á¡á¡á¡á¡á¡á¡á¡á
¡á¡á¡á¡á¡á¡á¡á¡á¡á
¡á¡á           ¡á¡á
 ¡å              ¡å)" << std::endl;
}

void Image::monster() {
    std::cout << R"(
¡Û¡Ú¡Ø¡ß¡Ü¡Þ¡à¡á¡â¡ã¡ä¡ä¡å
¢¸¢º¢¿¢À¢Ã¢Ì¢Ã
            ¡ã
          ¡á¡á
        ¡ß¡á¡á        ¡ã¡å
      ¡Ú¡á¡á¡á      ¡á¡á
        ¡á¡á¡á    ¡á¡á¡á
        ¡á¡á¡á    ¡á¡á¡á
        ¡á¡á¡á¡á¡á¡á¡á¡á
        ¡á¡á¡á¡á¡á¡á¡á¡á
      ¡å¡á¡á¡á¡á¡á¡á¡á¡á¡å
        ¡å¡á¡á¡á¡á¡á¡á
)" << std::endl;
}

void Image::Loading() {
    std::cout << R"()";
}